#include <iostream>
using namespace std;
int main() {
//8. ƒаны натуральные числа от 20 до 50.Ќапечатать те из них, которые дел€тс€ на 3, но не дел€тс€ на 5
	/*int a = 20;
	while (a <= 50) {
		if (a % 3 == 0 && a % 5 != 0)
			cout << a << "";
		a += 1;
	}*/
	//9. даны натуральные числа от 35 до 87. Ќайти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	/*int a=35;
	while (a <= 87) {
		if (a % 7 == 1 || a % 7 == 2 || a & 7 == 5) {
			cout << a << " ";
		}
		a++;
	}*/
	//10. ƒаны натуральные числа от 1 до 50. Ќайти сумму тех из них, которые дел€тс€ на 5 или на 7.
	/*int r, sum = 0;
	r = 1;
	while (r = 50) {
		if (r % 5 == 0 || r % 7 == 0) {
			sum += r;
		}
		r++;
	}*/
}